## Plan Result (ptlsbox-netbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 5 to change, 2 to destroy.</code></pre>

* Create
  * module.redis.azurerm_private_endpoint.this[0]
  * module.redis.azurerm_redis_cache.redis
* Update
  * azurerm_key_vault.netbox_key_vault
  * azurerm_resource_group.netbox_rg
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_resource_group.rg[0]
  * module.redis.azurerm_resource_group.cache-resourcegroup
* Delete
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;netbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.netbox_key_vault will be updated in-place
  ~ resource "azurerm_key_vault" "netbox_key_vault" {
        id                              = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
        name                            = "netbox-vault-ptlsbox"
      ~ tags                            = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.netbox_rg will be updated in-place
  ~ resource "azurerm_resource_group" "netbox_rg" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg"
        name     = "netbox-ptlsbox-rg"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-v14-flexible-data-ptlsbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox"
        name                          = "netbox-v14-flexible-ptlsbox"
      ~ tags                          = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      - id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-v14-flexible-data-ptlsbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox/administrators/9be14c5f-eebd-4ab6-b504-cae9417d304b" -> null
      - object_id           = "9be14c5f-eebd-4ab6-b504-cae9417d304b" -> null
      - principal_name      = "DTS Operations (env:ptlsbox)" -> null
      - principal_type      = "ServicePrincipal" -> null
      - resource_group_name = "netbox-v14-flexible-data-ptlsbox" -> null
      - server_name         = "netbox-v14-flexible-ptlsbox" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-v14-flexible-data-ptlsbox"
        name     = "netbox-v14-flexible-data-ptlsbox"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["netbox"] will be destroyed
  # (because key ["netbox"] is not in for_each map)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "7469866050560051849" -> null
      - triggers = {
          - "db_reader_user" = "DTS SDS DB Access Reader"
          - "name"           = "netbox-v14-flexible"
          - "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        } -> null
    }

  # module.redis.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "netbox-ptlsbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "netbox-cache-ptlsbox"
      + subnet_id                = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/ss-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptlsbox-vnet/subnets/iaas"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "netbox-ptlsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "netbox-ptlsbox"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "netbox-cache-ptlsbox"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = (known after apply)

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis.azurerm_resource_group.cache-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-cache-ptlsbox"
        name     = "netbox-cache-ptlsbox"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"ptlsbox-netbox","Vars":{}} -->